# Homebrew Tap

tap "daipeihust/tap"
tap "delphinus/sfmono-square"
tap "dwarvesf/homebrew-tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "homebrew/cask-fonts"

# Homebrew

brew "betterdisplay"
brew "bitwarden-cli"
# brew "carthage"
brew "colordiff"
brew "danger/tap/danger-swift"
# brew "fastlane"
brew "ffmpeg"
brew "fzf"
# brew "gcc"
brew "gh"
brew "git"
brew "git-delta"
# brew "gnuplot"
brew "goenv", args: ["HEAD"]
brew "gpg"
brew "graphviz"
brew "hugo"
brew "im-select"
brew "imagemagic"
brew "java"
brew "jenv"
brew "mas"
brew "mint"
brew "neovim"
# brew "nkf"
# brew "peco"
brew "pinentry-mac"
brew "rbenv"
brew "rbenv-communal-gems"
brew "reattach-to-user-namespace" # fix tmux [exited]
brew "ripgrep"
brew "ruby-build"
brew "rustup-init"
brew "sfmono-square"
# brew "skhd"
# brew "spacebar"
# brew "swiftlint"
brew "tig"
brew "tmux"
brew "tree"
brew "vim"
brew "xclogparser"
# brew "xcodegen"
# brew "yabai"

# Homebrew cask

# cask "activitywatch"
# cask "adobe-acrobat-reader"
# cask "alacritty"
cask "alfred"
cask "amethyst"
cask "android-studio"
cask "anki"
# cask "appcode"
# cask "aquaterm"
# cask "atom"
cask "authy"
# cask "background-music"
cask "bettertouchtool"
cask "bitwarden"
cask "blue-sherpa"
# cask "ccleaner"
cask "copilot-for-xcode"
cask "charles"
# cask "cheatsheet"
# cask "clickup"
cask "dash"
cask "discord"
# cask "docker"
# cask "dropbox"
cask "emacs"
cask "figma"
# cask "firefox"
cask "flutter"
cask "font-hack-nerd-font"
cask "font-mplus"
cask "font-plemol-jp-nf"
cask "font-source-han-code-jp"
cask "fork"
# cask "gimp"
# cask "google-backup-and-sync"
cask "google-chrome"
cask "google-japanese-ime"
cask "hammerspoon"
# cask "inkscape"
cask "insomnia"
cask "iterm2"
cask "logitech-options"
cask "logseq"
# cask "oracle-jdk"
cask "karabiner-elements"
cask "keyboard-maestro"
cask "keycastr"
cask "kindle"
# cask "macs-fan-control"
# cask "mactex"
cask "meetingbar"
# cask "mendeley"
cask "microsoft-excel"
cask "microsoft-powerpoint"
cask "microsoft-word"
# cask "miro"
cask "mos"
cask "notion"
cask "obs"
# cask "obs-virtualcam" # obs に入っている
cask "obsidian"
cask "proxyman"
cask "qlcolorcode"
cask "qlimagesize"
cask "qlmarkdown"
cask "qlprettypatch"
cask "qlstephen"
cask "qmk-toolbox"
cask "quicklook-csv"
cask "quicklook-json"
cask "raycast"
cask "refined-github-safari"
cask "screen"
# cask "scroll-reverser"
cask "sf-symbols"
# cask "skype"
# cask "sourcetree"
# cask "spotify"
# cask "station"
# cask "steermouse"
# cask "suspicious-package"
# cask "taskade"
cask "the-unarchiver"
# cask "ticktick"
cask "toggl-track"
# cask "typora"
cask "vimmotion"
cask "visual-studio-code"
cask "vlc"
cask "webpquicklook"
cask "xcodes"
# cask "xquartz"
cask "zeplin"
cask "zoom"

# mas: Mac App Store

# mas "BetterSnapTool", id:417375580
# mas "CommentScreen", id:1450950860
mas "cotEditor", id: 1024640650
mas "DaVinci Resolve", id: 571213070
mas "Dropover", id: 1355679052
# mas "LINE", id: 539883307
# mas "Manico", id: 724472954
# mas "Mathpix", id: 1349670778
# mas "Nozbe", id: 508957583
mas "Slack", id: 803453959
# mas "ToyViewer", id: 414298354
mas "Transporter", id: 1450874784
# mas "Xcode", id: 497799835

