tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "homebrew/cask-fonts"

# Homebrew

brew "bitwarden-cli"
brew "carthage"
brew "ffmpeg"
# brew "gcc"
brew "git"
# brew "gnuplot"
# brew "imagemagic"
brew "mas"
brew "mint"
# brew "nkf"
brew "reattach-to-user-namespace" # fix tmux [exited]
brew "skhd"
brew "spacebar"
brew "tmux"
brew "vim"
brew "xcodegen"
brew "yabai"

# Homebrew cask

# cask "adobe-acrobat-reader"
cask "alacritty"
cask "alfred"
# cask "aquaterm"
# cask "atom"
cask "bettertouchtool"
# cask "ccleaner"
# cask "cheatsheet"
cask "dash"
cask "discord"
# cask "dropbox"
cask "emacs"
# cask "firefox"
cask "font-mplus"
cask "font-source-han-code-jp"
# cask "gimp"
# cask "google-backup-and-sync"
cask "google-chrome"
cask "google-japanese-ime"
# cask "inkscape"
cask "karabiner-elements"
# cask "macs-fan-control"
# cask "mactex"
# cask "mendeley"
cask "miro"
cask "notion"
cask "obs"
cask "obs-virtualcam"
cask "obsidian"
cask "qlcolorcode"
cask "qlimagesize"
cask "qlmarkdown"
cask "qlprettypatch"
cask "qlstephen"
cask "quicklook-csv"
cask "quicklook-json"
# cask "scroll-reverser"
# cask "skype"
cask "sourcetree"
cask "station"
# cask "suspicious-package"
cask "the-unarchiver"
cask "ticktick"
cask "visual-studio-code"
cask "webpquicklook"
# cask "xquartz"
cask "zoomus"

# mas

# mas "BetterSnapTool", id:417375580
mas "CommentScreen", id:1450950860
mas "cotEditor", id: 1024640650
# mas "Kindle", id: 405399194
mas "LINE", id: 539883307
mas "Manico", id: 724472954
# mas "Mathpix", id: 1349670778
mas "Nozbe", id: 508957583 
mas "Slack", id: 803453959
# mas "ToyViewer", id: 414298354
mas "Xcode", id: 497799835

